from pathlib import Path


class PathError(Exception):
    pass


try:
    path = Path(__file__)
except NameError:
    raise PathError(
        'Переменная "__file__" недоступна. Программа не может продолжить работу.'
    )

INDEX = 2

if INDEX < len(path.parents):
    CWD = path.parents[INDEX]
else:
    raise PathError(
        f'Абсолютный путь к params.py содержит менее ({INDEX} + 1) уровней вложенности. '
        'Убедитесь, что модуль находится в директории с достаточной глубиной, '
        'или измените код для работы с текущей структурой файлов.'
    )

DICT_PATH = CWD / 'data/dictionary.txt'

WELCOME_MESSAGE = """
 _____________________________________________________________
|                                                             |
|              Вас приветствует игра "Виселица!               |
|                                                             |
|               Отгадайте зашифрованное слово                 |
|_____________________________________________________________|
"""

EMPTY = """
         ____
        |    |
             |
             |
             |
    _________|_____
"""
HEAD = """
         ____
        |    |
        O    |
             |
             |
    _________|_____
"""
BODY = """
         ____
        |    |
        O    |
        |    |
             |
    _________|_____
"""
R_HAND = """
         ____
        |    |
      __O    |
        |    |
             |
    _________|_____
"""
L_HAND = """
         ____
        |    |
      __O__  |
        |    |
             |
    _________|_____
"""
R_LEG = """
         ____
        |    |
      __O__  |
        |    |
       /     |
    _________|_____
"""
L_LEG = r"""
         ____
        |    |
      __O__  |
        |    |
       / \   |
    _________|_____
"""

STAGES = [EMPTY, HEAD, BODY, R_HAND, L_HAND, R_LEG, L_LEG]

CLEAR_SCREEN_TO_END = '\033[J'
CLEAR_CURRENT_LINE = '\033[K'

CYRILLIC_LETTER_MSG = 'Необходимо использовать буквы русского алфавита: а - я (А - Я)'
USED_LETTER_MSG = 'Вы уже вводили букву "{}" (см. Использованные буквы)'
EMPTY_LINE_MSG = 'Вы отправляете пустую строку. Введите букву'
MORE_THAN_ONE_SYMBOL_MSG = 'Вы ввели более одного символа. Введите один'
